---
kind: method
id: M:Autodesk.Revit.DB.Category.GetGraphicsStyle(Autodesk.Revit.DB.GraphicsStyleType)
source: html/4ab5abd4-6ffc-0506-079f-c9b2596ff138.htm
---
# Autodesk.Revit.DB.Category.GetGraphicsStyle Method

Gets the graphics style associated with this category for the given graphics style type.

## Syntax (C#)
```csharp
public GraphicsStyle GetGraphicsStyle(
	GraphicsStyleType graphicsStyleType
)
```

## Parameters
- **graphicsStyleType** (`Autodesk.Revit.DB.GraphicsStyleType`) - The type of graphics style.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - Thrown when the input argument-"graphicsStyleType"-is out of range.